//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

/*
int reverse(int num, int acc)
{
    while (num > 0) 
    { 
        acc = acc * 10 + num % 10; num /= 10; 
    }
    return acc;
}

int num = int.Parse(Console.ReadLine()!);
Console.WriteLine((num == 0) || (reverse(num, 0) == num));
Console.ReadKey(true);

*/

//Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.


